<?if(!defined("B_PROLOG_INCLUDED") || B_PROLOG_INCLUDED!==true) die();

class CGovCalc extends CBitrixComponent
{
    const BASIC_SALARY = 17697;
    const MIN_SALARY = 42500;
    const MRP = 2525;

    /*public function onPrepareComponentParams($arParams)
    {
        $result = array(
            "CACHE_TYPE" => $arParams["CACHE_TYPE"],
            "CACHE_TIME" => isset($arParams["CACHE_TIME"]) ?$arParams["CACHE_TIME"]: 36000000,
            "X" => intval($arParams["X"]),
        );
        return $result;
    }*/

    public function executeComponent()
    {
        $this->arResult["ORGS"] = array(
            1 => [
                'title' => 'Дошкольные организации',
                'child' => [
                    '1_1' => [
                        'title' => 'ясли-сад'
                    ],
                    '1_2' => [
                        'title' => 'детский сад',
                    ],
                    '1_3' => [
                        'title' => 'семейный ясли-сад',
                    ],
                    '1_4' => [
                        'title' => 'санаторный ясли-сад',
                    ],
                    '1_5' => [
                        'title' => 'комплекс "школа-ясли-сад"',
                    ],
                    '1_6' => [
                        'title' => 'дошкольный мини-центр',
                    ],
                ],
            ],
            2 => [
                'title' => 'Организации среднего образования (начального, основного среднего, общего среднего)',
                'child' => [
                    '2_1' => [
                        'title' => 'по уровням образования:',
                        'child' => [
                            '2_1_a' => [
                                'title' => 'начальная школа;'
                            ],
                            '2_1_b' => [
                                'title' => 'основная средняя школа;'
                            ],
                            '2_1_c' => [
                                'title' => 'общеобразовательная школа;'
                            ],
                        ]
                    ],
                    '2_2' => [
                        'title' => 'по профилю обучения:',
                        'child' => [
                            '2_2_a' => [
                                'title' => 'гимназия;'
                            ],
                            '2_2_b' => [
                                'title' => 'лицей;'
                            ],
                            '2_2_c' => [
                                'title' => 'профильная школа;'
                            ],
                        ]
                    ],
                    '2_3' => [
                        'title' => 'по условиям организации обучения:',
                        'child' => [
                            '2_3_a' => [
                                'title' => 'малокомплектная школа;'
                            ],
                            '2_3_b' => [
                                'title' => 'опорная школа (ресурсный центр);'
                            ],
                            '2_3_c' => [
                                'title' => 'общеобразовательная школа при исправительном учреждении;'
                            ],
                            '2_3_d' => [
                                'title' => 'вечерняя школа;'
                            ],
                            '2_3_e' => [
                                'title' => 'организация образования для детей с девиантным поведением;'
                            ],
                            '2_3_f' => [
                                'title' => 'организация образования для детей с особым режимом содержания;'
                            ],
                            '2_3_g' => [
                                'title' => 'школа при больнице; '
                            ],
                        ]
                    ],
                    '2_4' => [
                        'title' => 'международные:',
                        'child' => [
                            '2_4_a' => [
                                'title' => 'международная школа;'
                            ],
                        ]
                    ],
                    '2_5' => [
                        'title' => 'интернатные организации:',
                        'child' => [
                            '2_5_a' => [
                                'title' => 'школа-интернат;'
                            ],
                            '2_5_b' => [
                                'title' => 'военная школа-интернат;'
                            ],
                            '2_5_c' => [
                                'title' => 'интернат при общеобразовательной школе;'
                            ],
                            '2_5_d' => [
                                'title' => 'интернат при опорной школе (ресурсный центр);'
                            ],
                            '2_5_e' => [
                                'title' => 'школа-интернат для детей из многодетных и малообеспеченных семей;'
                            ],
                            '2_5_f' => [
                                'title' => 'санаторная школа-интернат;'
                            ],
                        ]
                    ],
                    '2_6' => [
                        'title' => 'комбинированные:',
                        'child' => [
                            '2_6_a' => [
                                'title' => 'школа-гимназия;'
                            ],
                            '2_6_b' => [
                                'title' => 'школа-лицей;'
                            ],
                            '2_6_c' => [
                                'title' => 'школа-центр дополнительного образования;'
                            ],
                            '2_6_d' => [
                                'title' => 'школа-интернат-колледж;'
                            ],
                            '2_6_e' => [
                                'title' => 'учебно-оздоровительный центр (комплекс);'
                            ],
                            '2_6_f' => [
                                'title' => 'учебно-производственный комбинат (межшкольный, курсовой);'
                            ],
                            '2_6_g' => [
                                'title' => 'учебно-воспитательный центр (комплекс);'
                            ],
                            '2_6_h' => [
                                'title' => 'учебный центр.'
                            ],
                        ]
                    ],
                ],
            ],
            3 => [
                'title' => 'Организации технического и профессионального образования:',
                'child' => [
                    '3_1' => [
                        'title' => 'колледж;'
                    ],
                    '3_2' => [
                        'title' => 'училище;',
                    ],
                    '3_3' => [
                        'title' => 'учебный центр профессиональной подготовки;',
                    ],
                    '3_4' => [
                        'title' => 'колледж для детей с особыми образовательными потребностями;',
                    ],
                    '3_5' => [
                        'title' => 'учебный центр профессиональной подготовки при исправительном учреждении;',
                    ],
                    '3_6' => [
                        'title' => 'колледж при исправительном учреждении;',
                    ],
                    '3_7' => [
                        'title' => 'военно-технический колледж;',
                    ],
                    '3_8' => [
                        'title' => 'высший колледж.',
                    ],
                ],
            ],
            4 => [
                'title' => 'Организации послесреднего образования:',
                'child' => [
                    '4_1' => [
                        'title' => 'колледж;'
                    ],
                    '4_2' => [
                        'title' => 'высший колледж;',
                    ],
                    '4_3' => [
                        'title' => 'училище.',
                    ],
                ],
            ],
            5 => [
                'title' => 'Организации высшего и (или) послевузовского образования:',
                'child' => [
                    '5_1' => [
                        'title' => 'национальный исследовательский университет;'
                    ],
                    '5_2' => [
                        'title' => 'национальная организация высшего и (или) послевузовского образования;',
                    ],
                    '5_3' => [
                        'title' => 'исследовательский университет;',
                    ],
                    '5_4' => [
                        'title' => 'университет;',
                    ],
                    '5_5' => [
                        'title' => 'академия;',
                    ],
                    '5_6' => [
                        'title' => 'институт;',
                    ],
                    '5_7' => [
                        'title' => 'консерватория.;',
                    ],
                ],
            ],
            6 => [
                'title' => 'Специализированные организации образования',
                'child' => [
                    '6_1' => [
                        'title' => 'специализированная школа;'
                    ],
                    '6_2' => [
                        'title' => 'специализированный лицей (специализированная школа - лицей);',
                    ],
                    '6_3' => [
                        'title' => 'специализированная гимназия (специализированная школа - гимназия);',
                    ],
                    '6_4' => [
                        'title' => 'специализированная школа - интернат;',
                    ],
                    '6_5' => [
                        'title' => 'специализированная школа - лицей - интернат;',
                    ],
                    '6_6' => [
                        'title' => 'специализированная школа - гимназия - интернат;',
                    ],
                    '6_7' => [
                        'title' => 'специализированная музыкальная школа - интернат;',
                    ],
                    '6_8' => [
                        'title' => 'специализированная спортивная школа - интернат (специализированная школа - интернат - колледж олимпийского резерва);'
                    ],
                    '6_9' => [
                        'title' => 'специализированная хореографическая школа - интернат (специализированная хореографическая школа - интернат - училище);',
                    ],
                    '6_10' => [
                        'title' => 'специализированная военная школа - интернат;',
                    ],
                    '6_11' => [
                        'title' => 'лицей-интернат "Білім - инновация";',
                    ],
                    '6_12' => [
                        'title' => 'специализированная школа - комплекс',
                    ],
                    '6_13' => [
                        'title' => 'специализированная школа - лицей информационных технологий;',
                    ],
                    '6_14' => [
                        'title' => 'специализированный лицей информационных технологий.',
                    ],
                ],
            ],
            7 => [
                'title' => 'Специальные организации образования:',
                'child' => [
                    '7_1' => [
                        'title' => 'специальный ясли - сад;'
                    ],
                    '7_2' => [
                        'title' => 'специальный детский сад;',
                    ],
                    '7_3' => [
                        'title' => 'специальная школа;',
                    ],
                    '7_4' => [
                        'title' => 'специальная школа - интернат;',
                    ],
                    '7_5' => [
                        'title' => 'специальный комплекс "детский сад - школа - интернат";',
                    ],
                    '7_6' => [
                        'title' => 'специальный комплекс "школа - интернат - колледж";',
                    ],
                    '7_7' => [
                        'title' => 'психолого - медико - педагогическая консультация;',
                    ],
                    '7_8' => [
                        'title' => 'реабилитационный центр;'
                    ],
                    '7_9' => [
                        'title' => 'кабинет психолого - педагогической коррекции;',
                    ],
                    '7_10' => [
                        'title' => 'логопедический пункт.',
                    ],
                ],
            ],
            8 => [
                'title' => 'Организации образования для детей-сирот и детей, оставшихся без попеченияя родителей:',
                'child' => [
                    '8_1' => [
                        'title' => 'детский дом;'
                    ],
                    '8_2' => [
                        'title' => 'детский дом для детей с особыми образовательными потребностями;',
                    ],
                    '8_3' => [
                        'title' => 'школа-интернат  для детей-сирот и детей, оставшихся без попеченияя родителей;',
                    ],
                    '8_4' => [
                        'title' => 'школа-интернат  для детей-сирот и детей, оставшихся без попеченияя родителей, с особыми образовательными потребностями;',
                    ],
                    '8_5' => [
                        'title' => 'детский дом семейного типа;',
                    ],
                    '8_6' => [
                        'title' => 'детская деревня семейного типа;',
                    ],
                    '8_7' => [
                        'title' => 'приют;',
                    ],
                    '8_8' => [
                        'title' => 'центр адаптации есовершеннолетних;'
                    ],
                    '8_9' => [
                        'title' => 'дом юношества (центр социальной адаптации);',
                    ],
                    '8_10' => [
                        'title' => 'центр поддержки детей, находящихся в трудной жизненной ситуации.',
                    ],
                ],
            ],
            9 => [
                'title' => 'Организации дополнительного образования для детей:',
                'child' => [
                    '9_1' => [
                        'title' => 'дошкольный развивающий комплекс (центр, академия);'
                    ],
                    '9_2' => [
                        'title' => 'дворец школьников (дома, центры, комплексы, центры детско-юношеского творчества);',
                    ],
                    '9_3' => [
                        'title' => 'стации юных натуралистов (детские экологические центры, биологические центры, экобиоцентры);',
                    ],
                    '9_4' => [
                        'title' => 'станции юных техников (центры, школы технического творчества детей и юношества);',
                    ],
                    '9_5' => [
                        'title' => 'станции юных туристов (центры детско-юношеского туризма);',
                    ],
                    '9_6' => [
                        'title' => 'детский дворовый клуб, детский военно-патриотический клуб (клубные досуговые организации);',
                    ],
                    '9_7' => [
                        'title' => 'детские школы искусств (детские музыкальные школы, детские художественные школы, детские школы искусств, школы художественно-эстетической направленности);',
                    ],
                    '9_8' => [
                        'title' => 'детский оздоровительный лагерь (центры, комплексы, загородные оздоровительные лагеря и лагеря дневного пребывания, палаточные, юрточные);'
                    ],
                    '9_9' => [
                        'title' => 'детско-юношеская спортивная школа;',
                    ],
                    '9_10' => [
                        'title' => 'специализированная детско-юношеская школа олимпийского резерва;',
                    ],
                    '9_11' => [
                        'title' => 'организации по направлениям деятельности и интересам детей;',
                    ],
                    '9_12' => [
                        'title' => 'учебно-методические и научно-методические центры дополнительного образования для детей.',
                    ],
                ],
            ],
            10 => [
                'title' => 'Организации дополнительного образования для взрослых:',
                'child' => [
                    '10_1' => [
                        'title' => 'институт дополнительного образования;'
                    ],
                    '10_2' => [
                        'title' => 'методический центр (кабинет);',
                    ],
                    '10_3' => [
                        'title' => 'учебный центр (региональный, межрегиональный, отраслевой) дополнительного образования;',
                    ],
                    '10_4' => [
                        'title' => 'структурное подразделение дополнительного образования юридического лица, осуществляющего образовательную деятельность.',
                    ],
                ],
            ],
        );

        $this->arResult["POSITIONS"] = array(
            'A' => [
                'title' => 'управленческий персонал',
                'child' => [
                    'A1' => [
                        'child' => [
                            'A1_1' => [
                                'title' => 'Руководители ГУ и ГКП республиканского значения'
                            ],
                            'A1_1_1' => [
                                'title' => 'Заместители руководителей ГУ и ГКП республиканского значения'
                            ],
                            'A1_2' => [
                                'title' => 'Руководители ГУ и ГКП областного значения (столицы, города республиканского значения)'
                            ],
                            'A1_2_1' => [
                                'title' => 'Заместители руководителей ГУ и ГКП областного значения (столицы, города республиканского значения)'
                            ],
                            'A1_3' => [
                                'title' => 'Руководители ГУ и ГКП районного значения (города областного значения)'
                            ],
                            'A1_3_1' => [
                                'title' => 'Заместители руководителей ГУ и ГКП районного значения (города областного значения)'
                            ],
                            'A1_4' => [
                                'title' => 'Руководители ГУ и ГКП сельского значения'
                            ]
                        ]
                    ],
                    'A2' => [
                        'child' => [
                            'A2_1' => [
                                'title' => 'Руководители структурных подразделений ГУ и ГКП республиканского значения'
                            ],
                            'A2_1_1' => [
                                'title' => 'Заместители руководителей структурных подразделений ГУ и ГКП республиканского значения'
                            ],
                            'A2_2' => [
                                'title' => 'Руководители структурных подразделений ГУ и ГКП областного значения (столицы, города республиканского значения)'
                            ],
                            'A2_2_1' => [
                                'title' => 'Заместители руководителей структурных подразделений ГУ и ГКП областного значения (столицы, города республиканского значения)'
                            ],
                            'A2_3' => [
                                'title' => 'Руководители структурных подразделений ГУ и ГКП районного значения (города областного значения)'
                            ],
                            'A2_3_1' => [
                                'title' => 'Заместители руководителей структурных подразделений ГУ и ГКП районного значения (города областного значения)'
                            ],
                            'A2_4' => [
                                'title' => 'Руководители структурных подразделений ГУ и ГКП сельского значения'
                            ]
                        ]
                    ],
                    'A3' => [
                        'child' => [
                            'A3_1' => [
                                'title' => 'Руководители подразделений структурных подразделений ГУ и ГКП республиканского значения'
                            ],
                            'A3_1_1' => [
                                'title' => 'Заместители руководителей подразделений структурных подразделений ГУ и ГКП республиканского значения'
                            ],
                            'A3_2' => [
                                'title' => 'Руководители подразделений структурных подразделений ГУ и ГКП областного значения (столицы, города республиканского значения)'
                            ],
                            'A3_2_1' => [
                                'title' => 'Заместители руководителей подразделений структурных подразделений ГУ и ГКП областного значения (столицы, города республиканского значения)'
                            ],
                            'A3_3' => [
                                'title' => 'Руководители подразделений структурных подразделений ГУ и ГКП районного значения (города областного значения)'
                            ],
                            'A3_3_1' => [
                                'title' => 'Заместители руководителей подразделений структурных подразделений ГУ и ГКП районного значения (города областного значения)'
                            ],
                            'A3_4' => [
                                'title' => 'Руководители подразделений структурных подразделений ГУ и ГКП сельского значения'
                            ],
                        ]
                    ],
                ]
            ],
            'B' => [
                'title' => 'основной персонал',
                'child' => [
                    'B1' => [
                        'child' => [
                            'B1_1' => [
                                'title' => 'Главный научный сотрудник, профессор'
                            ],
                            'B1_2' => [
                                'title' => 'Ведущий научный сотрудник, доцент
Главный эксперт
'
                            ],
                            'B1_3' => [
                                'title' => 'Старший научный сотрудник
Ведущий эксперт
Старший методист научно-практического центра
'
                            ],
                            'B1_4' => [
                                'title' => 'Научный сотрудник
Старший эксперт
Методист научно-практического центра
Преподаватель высшего учебного заведения, организации технического и профессионального образования
'
                            ],
                            'B1_5' => [
                                'title' => 'Младший научный сотрудник
Методист высшего учебного заведения, организации технического и профессионального образования
Ассистент
Эксперт
Мастер организации технического и профессионального образования
'
                            ],
                        ]
                    ],
                    'B2' => [
                        'child' => [
                            'B2_1' => [
                                'title' => 'Специалисты (врач, учитель) основного персонала высшего уровня квалификации высшей категории'
                            ],
                            'B2_2' => [
                                'title' => 'Специалисты (врач, учитель) основного персонала высшего уровня квалификации первой категории'
                            ],
                            'B2_3' => [
                                'title' => 'Специалисты (врач, учитель) основного персонала высшего уровня квалификации второй категории'
                            ],
                            'B2_4' => [
                                'title' => 'Специалисты (врач, учитель) основного персонала высшего уровня квалификации без категории'
                            ],
                        ]
                    ],
                    'B3' => [
                        'child' => [
                            'B3_1' => [
                                'title' => 'Специалисты (воспитатель, социальный педагог, специалисты среднего медицинского персонала и другие) основного персонала высшего уровня квалификации высшей категории'
                            ],
                            'B3_2' => [
                                'title' => 'Специалисты (воспитатель, социальный педагог, специалисты среднего медицинского персонала и другие) основного персонала высшего уровня квалификации первой категории'
                            ],
                            'B3_3' => [
                                'title' => 'Специалисты (воспитатель, социальный педагог, специалисты среднего медицинского персонала и другие) основного персонала высшего уровня квалификации второй категории'
                            ],
                            'B3_4' => [
                                'title' => 'Специалисты (воспитатель, социальный педагог, специалисты среднего медицинского персонала и другие) основного персонала высшего уровня квалификации без категории'
                            ],
                        ]
                    ],
                    'B4' => [
                        'child' => [
                            'B4_1' => [
                                'title' => 'Специалисты основного персонала среднего уровня квалификации высшей категории'
                            ],
                            'B4_2' => [
                                'title' => 'Специалисты основного персонала среднего уровня квалификации первой категории'
                            ],
                            'B4_3' => [
                                'title' => 'Специалисты основного персонала среднего уровня квалификации второй категории'
                            ],
                            'B4_4' => [
                                'title' => 'Специалисты основного персонала среднего уровня квалификации без категории'
                            ],
                        ]
                    ],
                ]
            ],
            'MED_B' => [
                'title' => 'В прочих сферах',
                'child' => [
                    'MED_B2' => [
                        'child' => [
                            'MED_B2_1' => [
                                'title' => 'Специалисты высшего уровня квалификации высшей категории: врачи всех специальностей'
                            ],
                            'MED_B2_2' => [
                                'title' => 'Специалисты высшего уровня квалификации первой категории: врачи всех специальностей'
                            ],
                            'MED_B2_3' => [
                                'title' => 'Специалисты высшего уровня квалификации второй категории: врачи всех специальностей'
                            ],
                            'MED_B2_4' => [
                                'title' => 'Специалисты высшего уровня квалификации без категории: врачи всех специальностей'
                            ],
                        ]
                    ],
                    'MED_B3' => [
                        'child' => [
                            'MED_B3_1' => [
                                'title' => 'Специалисты высшего уровня квалификации высшей категории: медицинская (ий) сестра (брат)'
                            ],
                            'MED_B3_2' => [
                                'title' => 'Специалисты высшего уровня квалификации первой категории: медицинская (ий) сестра (брат)'
                            ],
                            'MED_B3_3' => [
                                'title' => 'Специалисты высшего уровня квалификации второй категории: медицинская (ий) сестра (брат)'
                            ],
                            'MED_B3_4' => [
                                'title' => 'Специалисты высшего уровня квалификации без категории: медицинская (ий) сестра (брат)'
                            ],
                        ]
                    ],
                    'MED_B4' => [
                        'child' => [
                            'MED_B4_1' => [
                                'title' => 'Специалисты среднего уровня квалификации высшей категории: медицинская (ий) сестра (брат), зубной врач (дантист), инструктор по лечебной физкультуре, диетическая сестра'
                            ],
                            'MED_B4_2' => [
                                'title' => 'Специалисты среднего уровня квалификации первой категории: медицинская (ий) сестра (брат), зубной врач (дантист), инструктор по лечебной физкультуре, диетическая сестра'
                            ],
                            'MED_B4_3' => [
                                'title' => 'Специалисты среднего уровня квалификации второй категории: медицинская (ий) сестра (брат), зубной врач (дантист), инструктор по лечебной физкультуре, диетическая сестра'
                            ],
                            'MED_B4_4' => [
                                'title' => 'Специалисты среднего уровня квалификации без категории: медицинская (ий) сестра (брат), зубной врач (дантист), инструктор по лечебной физкультуре, диетическая сестра, помощник врача-стоматолога (ассистент стоматолога), инструктор по лечебной физкультуре, диетическая сестра'
                            ],
                        ]
                    ],
                ]
            ],
            'OTHER_B' => [
                'title' => 'В прочих сферах',
                'child' => [
                    'OTHER_B2' => [
                        'child' => [
                            'OTHER_B2_1' => [
                                'title' => 'Специалисты основного персонала высшего уровня квалификации высшей категории'
                            ],
                            'OTHER_B2_2' => [
                                'title' => 'Специалисты основного персонала высшего уровня квалификации первой категории'
                            ],
                            'OTHER_B2_3' => [
                                'title' => 'Специалисты основного персонала высшего уровня квалификации второй категории'
                            ],
                            'OTHER_B2_4' => [
                                'title' => 'Специалисты основного персонала высшего уровня квалификации без категории'
                            ],
                        ]
                    ],
                    'OTHER_B3' => [
                        'child' => [
                            'OTHER_B3_1' => [
                                'title' => 'Специалисты основного персонала среднего уровня квалификации высшей категории'
                            ],
                            'OTHER_B3_2' => [
                                'title' => 'Специалисты основного персонала среднего уровня квалификации первой категории'
                            ],
                            'OTHER_B3_3' => [
                                'title' => 'Специалисты основного персонала среднего уровня квалификации второй категории'
                            ],
                            'OTHER_B3_4' => [
                                'title' => 'Специалисты основного персонала среднего уровня квалификации без категории'
                            ],
                        ]
                    ],
                ]
            ],
            'C' => [
                'title' => '',
                'child' => [
                    'C1' => [
                        'title' => 'Заведующие хозяйственными подразделениями ГУ и ГКП и иные отдельные приравненные к ним должности'
                    ],
                    'C2' => [
                        'title' => 'Специалисты высшего уровня квалификации, выполняющие административные функции'
                    ],
                    'C3' => [
                        'title' => '1) Специалисты среднего уровня квалификации, выполняющие административные функции;
2) Руководитель структурного подразделения, занятого хозяйственным обслуживанием ГУ и ГКП
'
                    ],
                ]
            ],
            'D' => [
                'title' => 'Технические исполнители',
            ]
        );

        $this->arResult['ED_LEVELS'] = [
            'tech_pro' => 'техническое и профессиональное образование;',
            'after_mid' => 'послесреднее образование;',
            'high' => 'высшее образование;',
            'after_high' => 'послевузовское образование.',
        ];

        $this->arResult['DOC_DEGREES'] = [
            1 => 'Кандидат наук, 
доктор философии (PhD), 
доктор по профилю ',
            2 => 'Доктор наук'
        ];

        $this->arResult['WORK_EXP'] = [
            '0_3' => '0-3',
            '3_6' => '3-6',
            '6_9' => '6-9',
            '9_12' => '9-12',
            '12_16' => '12-16',
            '16_20' => '16-20',
            '20_25' => '20-25',
            'more_25' => 'Свыше 25',
        ];

        $this->arResult['WORK_EXP_2'] = [
            '0_1' => '0-1',
            '1_2' => '1-2',
            '2_3' => '2-3',
            '3_5' => '3-5',
            '5_7' => '5-7',
            '7_10' => '7-10',
            '10_13' => '10-13',
            '13_16' => '13-16',
            'exp2_16_20' => '16-20',
            'exp2_20_25' => '20-25',
            'exp2_more_25' => 'Свыше 25',
        ];

        $this->arResult['QUALIF_LEVELS'] = [
            1 => 'первый (продвинутый)',
            2 => 'второй (основной) ',
            3 => 'третий (базовый)',
        ];

        $this->arResult['HONOR_TITLES'] = [
            1 => 'Народный',
            2 => 'Заслуженный'
        ];

        $this->arResult['ecology_types'] = [
            1 => 'Зона экологической котострофы',
            2 => 'Зона экологического кризиса',
            3 => 'Зона экологического предкризисного состояния',
        ];

        $this->arResult['radiation_types'] = [
            1 => 'Зона чрезвычайно радиационного риска',
            2 => 'Зона максимального радиационного риска',
            3 => 'Зона повышенного радиационного риска',
            4 => 'Зона минимального радиационного риска',
        ];

        $this->arResult['class_types'] = [
            1 => '1-4 классов',
            2 => '5-11(12) классов',
            3 => 'организаций технического и профессионального, послесреднего образования',
        ];

        $this->arResult['inclusive_types'] = [
            1 => 'работа с детьми с ограниченными возможностями в физическом развитии',
            2 => 'работа с детьми с ограниченными возможностями в умственном развитии, подлежащими обучению в организациях образования',
            3 => 'работа с детьми с психоневрологическими патологиями (не подлежащими обучению в организациях образования)',
        ];

        $this->arResult['classroom_types'] = [
            1 => 'в школах и школах-интернатах, детских домах',
            2 => 'в организациях технического и профессионального, послесреднего образования',
            3 => 'при наличии комбинированных мастерских',
        ];

        $coefficient = array(
            '0_3' => [
                'A1_1' => 5.84,
                'A1_1_1' => 5.55,
                'A1_2' => 5.21,
                'A1_2_1' => 4.95,
                'A1_3' => 4.66,
                'A1_3_1' => 4.43,
                'A1_4' => 4.21,
                'A2_1' => 5.84,
                'A2_1_1' => 5.04,
                'A2_2' => 4.74,
                'A2_2_1' => 4.50,
                'A2_3' => 4.24,
                'A2_3_1' => 4.03,
                'A2_4' => 3.83,
                'A3_1' => 4.83,
                'A3_1_1' => 4.59,
                'A3_2' => 4.31,
                'A3_2_1' => 4.09,
                'A3_3' => 3.85,
                'A3_3_1' => 3.66,
                'A3_4' => 3.47,
            ],
            '3_6' => [
                'A1_1' => 6.00,
                'A1_1_1' => 5.71,
                'A1_2' => 5.36,
                'A1_2_1' => 5.09,
                'A1_3' => 4.79,
                'A1_3_1' => 4.55,
                'A1_4' => 4.33,
                'A2_1' => 5.46,
                'A2_1_1' => 5.18,
                'A2_2' => 4.87,
                'A2_2_1' => 4.63,
                'A2_3' => 4.36,
                'A2_3_1' => 4.14,
                'A2_4' => 3.94,
                'A3_1' => 4.97,
                'A3_1_1' => 4.72,
                'A3_2' => 4.43,
                'A3_2_1' => 4.20,
                'A3_3' => 3.96,
                'A3_3_1' => 3.76,
                'A3_4' => 3.57,
            ],
            '6_9' => [
                'A1_1' => 6.17,
                'A1_1_1' => 5.87,
                'A1_2' => 5.51,
                'A1_2_1' => 5.23,
                'A1_3' => 4.92,
                'A1_3_1' => 4.68,
                'A1_4' => 4.45,
                'A2_1' => 5.61,
                'A2_1_1' => 5.33,
                'A2_2' => 5.01,
                'A2_2_1' => 4.76,
                'A2_3' => 4.48,
                'A2_3_1' => 4.26,
                'A2_4' => 4.05,
                'A3_1' => 5.11,
                'A3_1_1' => 4.85,
                'A3_2' => 4.55,
                'A3_2_1' => 4.32,
                'A3_3' => 4.07,
                'A3_3_1' => 3.87,
                'A3_4' => 3.67,
            ],
            '9_12' => [
                'A1_1' => 6.34,
                'A1_1_1' => 6.03,
                'A1_2' => 5.66,
                'A1_2_1' => 5.38,
                'A1_3' => 5.06,
                'A1_3_1' => 4.81,
                'A1_4' => 4.57,
                'A2_1' => 5.77,
                'A2_1_1' => 5.48,
                'A2_2' => 5.15,
                'A2_2_1' => 4.89,
                'A2_3' => 4.61,
                'A2_3_1' => 4.38,
                'A2_4' => 4.16,
                'A3_1' => 5.25,
                'A3_1_1' => 4.99,
                'A3_2' => 4.68,
                'A3_2_1' => 4.44,
                'A3_3' => 4.18,
                'A3_3_1' => 3.98,
                'A3_4' => 3.77,
            ],
            '12_16' => [
                'A1_1' => 6.52,
                'A1_1_1' => 6.20,
                'A1_2' => 5.82,
                'A1_2_1' => 5.53,
                'A1_3' => 5.20,
                'A1_3_1' => 4.94,
                'A1_4' => 4.70,
                'A2_1' => 5.93,
                'A2_1_1' => 5.63,
                'A2_2' => 5.29,
                'A2_2_1' => 5.03,
                'A2_3' => 4.74,
                'A2_3_1' => 4.50,
                'A2_4' => 4.28,
                'A3_1' => 5.40,
                'A3_1_1' => 5.13,
                'A3_2' => 4.81,
                'A3_2_1' => 4.56,
                'A3_3' => 4.30,
                'A3_3_1' => 4.09,
                'A3_4' => 3.88,
            ],
            '16_20' => [
                'A1_1' => 6.70,
                'A1_1_1' => 6.37,
                'A1_2' => 5.98,
                'A1_2_1' => 5.68,
                'A1_3' => 5.35,
                'A1_3_1' => 5.08,
                'A1_4' => 4.83,
                'A2_1' => 6.10,
                'A2_1_1' => 5.79,
                'A2_2' => 5.44,
                'A2_2_1' => 5.17,
                'A2_3' => 4.87,
                'A2_3_1' => 4.63,
                'A2_4' => 4.40,
                'A3_1' => 5.55,
                'A3_1_1' => 5.27,
                'A3_2' => 4.94,
                'A3_2_1' => 4.69,
                'A3_3' => 4.42,
                'A3_3_1' => 4.20,
                'A3_4' => 3.99,
            ],
            '20_25' => [
                'A1_1' => 6.89,
                'A1_1_1' => 6.55,
                'A1_2' => 6.15,
                'A1_2_1' => 5.84,
                'A1_3' => 5.50,
                'A1_3_1' => 5.22,
                'A1_4' => 4.97,
                'A2_1' => 6.27,
                'A2_1_1' => 5.95,
                'A2_2' => 5.59,
                'A2_2_1' => 5.31,
                'A2_3' => 5.01,
                'A2_3_1' => 4.76,
                'A2_4' => 4.52,
                'A3_1' => 5.71,
                'A3_1_1' => 5.42,
                'A3_2' => 5.08,
                'A3_2_1' => 4.82,
                'A3_3' => 4.54,
                'A3_3_1' => 4.32,
                'A3_4' => 4.10,
            ],
            'more_25' => [
                'A1_1' => 7.08,
                'A1_1_1' => 6.73,
                'A1_2' => 6.32,
                'A1_2_1' => 6.00,
                'A1_3' => 5.65,
                'A1_3_1' => 5.37,
                'A1_4' => 5.11,
                'A2_1' => 6.45,
                'A2_1_1' => 6.12,
                'A2_2' => 5.75,
                'A2_2_1' => 5.46,
                'A2_3' => 5.15,
                'A2_3_1' => 4.89,
                'A2_4' => 4.65,
                'A3_1' => 5.87,
                'A3_1_1' => 5.57,
                'A3_2' => 5.22,
                'A3_2_1' => 4.95,
                'A3_3' => 4.67,
                'A3_3_1' => 4.44,
                'A3_4' => 4.21,
            ],
            '0_1' => [
                'B1_1' => 5.09,
                'B1_2' => 4.63,
                'B1_3' => 4.21,
                'B1_4' => 3.83,
                'B1_5' => 3.48,
                'B2_1' => 4.06,
                'B2_2' => 3.66,
                'B2_3' => 3.49,
                'B2_4' => 3.08,
                'B3_1' => 3.75,
                'B3_2' => 3.35,
                'B3_3' => 3.18,
                'B3_4' => 2.77,
                'B4_1' => 3.40,
                'B4_2' => 2.92,
                'B4_3' => 2.75,
                'B4_4' => 2.34,
                'MED_B2_1' => 4.57,
                'MED_B2_2' => 3.98,
                'MED_B2_3' => 3.73,
                'MED_B2_4' => 3.08,
                'MED_B3_1' => 4.26,
                'MED_B3_2' => 3.67,
                'MED_B3_3' => 3.42,
                'MED_B3_4' => 2.77,
                'MED_B4_1' => 3.30,
                'MED_B4_2' => 2.94,
                'MED_B4_3' => 2.71,
                'MED_B4_4' => 2.26,
                'OTHER_B2_1' => 3.72,
                'OTHER_B2_2' => 3.41,
                'OTHER_B2_3' => 3.33,
                'OTHER_B2_4' => 3.08,
                'OTHER_B3_1' => 3.24,
                'OTHER_B3_2' => 2.91,
                'OTHER_B3_3' => 2.83,
                'OTHER_B3_4' => 2.58,
                'C1' => 3.39,
                'C2' => 3.08,
                'C3' => 2.05,
                'D' => 1.64,
            ],
            '1_2' => [
                'B1_1' => 5.19,
                'B1_2' => 4.72,
                'B1_3' => 4.29,
                'B1_4' => 3.90,
                'B1_5' => 3.55,
                'B2_1' => 4.12,
                'B2_2' => 3.72,
                'B2_3' => 3.55,
                'B2_4' => 3.14,
                'B3_1' => 3.80,
                'B3_2' => 3.40,
                'B3_3' => 3.23,
                'B3_4' => 2.82,
                'B4_1' => 3.44,
                'B4_2' => 2.96,
                'B4_3' => 2.79,
                'B4_4' => 2.38,
                'MED_B2_1' => 4.63,
                'MED_B2_2' => 4.04,
                'MED_B2_3' => 3.79,
                'MED_B2_4' => 3.14,
                'MED_B3_1' => 4.31,
                'MED_B3_2' => 3.72,
                'MED_B3_3' => 3.47,
                'MED_B3_4' => 2.82,
                'MED_B4_1' => 3.34,
                'MED_B4_2' => 2.98,
                'MED_B4_3' => 2.75,
                'MED_B4_4' => 2.30,
                'OTHER_B2_1' => 3.78,
                'OTHER_B2_2' => 3.47,
                'OTHER_B2_3' => 3.39,
                'OTHER_B2_4' => 3.14,
                'OTHER_B3_1' => 3.29,
                'OTHER_B3_2' => 2.96,
                'OTHER_B3_3' => 2.88,
                'OTHER_B3_4' => 2.63,
                'C1' => 3.47,
                'C2' => 3.15,
                'C3' => 2.10,
                'D' => 1.68,
            ],
            '2_3' => [
                'B1_1' => 5.29,
                'B1_2' => 4.81,
                'B1_3' => 4.37,
                'B1_4' => 3.97,
                'B1_5' => 3.62,
                'B2_1' => 4.18,
                'B2_2' => 3.78,
                'B2_3' => 3.61,
                'B2_4' => 3.20,
                'B3_1' => 3.85,
                'B3_2' => 3.45,
                'B3_3' => 3.28,
                'B3_4' => 2.87,
                'B4_1' => 3.49,
                'B4_2' => 3.01,
                'B4_3' => 2.84,
                'B4_4' => 2.43,
                'MED_B2_1' => 4.69,
                'MED_B2_2' => 4.10,
                'MED_B2_3' => 3.85,
                'MED_B2_4' => 3.20,
                'MED_B3_1' => 4.36,
                'MED_B3_2' => 3.77,
                'MED_B3_3' => 3.52,
                'MED_B3_4' => 2.87,
                'MED_B4_1' => 3.38,
                'MED_B4_2' => 3.02,
                'MED_B4_3' => 2.79,
                'MED_B4_4' => 2.34,
                'OTHER_B2_1' => 3.84,
                'OTHER_B2_2' => 3.53,
                'OTHER_B2_3' => 3.45,
                'OTHER_B2_4' => 3.20,
                'OTHER_B3_1' => 3.34,
                'OTHER_B3_2' => 3.01,
                'OTHER_B3_3' => 2.93,
                'OTHER_B3_4' => 2.68,
                'C1' => 3.55,
                'C2' => 3.22,
                'C3' => 2.15,
                'D' => 1.72,
            ],
            '3_5' => [
                'B1_1' => 5.39,
                'B1_2' => 4.90,
                'B1_3' => 4.45,
                'B1_4' => 4.05,
                'B1_5' => 3.69,
                'B2_1' => 4.24,
                'B2_2' => 3.84,
                'B2_3' => 3.67,
                'B2_4' => 3.26,
                'B3_1' => 3.90,
                'B3_2' => 3.50,
                'B3_3' => 3.33,
                'B3_4' => 2.92,
                'B4_1' => 3.54,
                'B4_2' => 3.06,
                'B4_3' => 2.89,
                'B4_4' => 2.48,
                'MED_B2_1' => 4.75,
                'MED_B2_2' => 4.16,
                'MED_B2_3' => 3.91,
                'MED_B2_4' => 3.26,
                'MED_B3_1' => 4.41,
                'MED_B3_2' => 3.82,
                'MED_B3_3' => 3.57,
                'MED_B3_4' => 2.92,
                'MED_B4_1' => 3.42,
                'MED_B4_2' => 3.06,
                'MED_B4_3' => 2.83,
                'MED_B4_4' => 2.38,
                'OTHER_B2_1' => 3.90,
                'OTHER_B2_2' => 3.59,
                'OTHER_B2_3' => 3.51,
                'OTHER_B2_4' => 3.26,
                'OTHER_B3_1' => 3.39,
                'OTHER_B3_2' => 3.06,
                'OTHER_B3_3' => 2.98,
                'OTHER_B3_4' => 2.73,
                'C1' => 3.63,
                'C2' => 3.29,
                'C3' => 2.20,
                'D' => 1.76,
            ],
            '5_7' => [
                'B1_1' => 5.49,
                'B1_2' => 4.99,
                'B1_3' => 4.53,
                'B1_4' => 4.13,
                'B1_5' => 3.76,
                'B2_1' => 4.30,
                'B2_2' => 3.90,
                'B2_3' => 3.73,
                'B2_4' => 3.32,
                'B3_1' => 3.96,
                'B3_2' => 3.56,
                'B3_3' => 3.39,
                'B3_4' => 2.98,
                'B4_1' => 3.59,
                'B4_2' => 3.11,
                'B4_3' => 2.94,
                'B4_4' => 2.53,
                'MED_B2_1' => 4.81,
                'MED_B2_2' => 4.22,
                'MED_B2_3' => 3.97,
                'MED_B2_4' => 3.32,
                'MED_B3_1' => 4.47,
                'MED_B3_2' => 3.88,
                'MED_B3_3' => 3.63,
                'MED_B3_4' => 2.98,
                'MED_B4_1' => 3.47,
                'MED_B4_2' => 3.11,
                'MED_B4_3' => 2.88,
                'MED_B4_4' => 2.43,
                'OTHER_B2_1' => 3.96,
                'OTHER_B2_2' => 3.65,
                'OTHER_B2_3' => 3.57,
                'OTHER_B2_4' => 3.32,
                'OTHER_B3_1' => 3.44,
                'OTHER_B3_2' => 3.11,
                'OTHER_B3_3' => 3.03,
                'OTHER_B3_4' => 2.78,
                'C1' => 3.71,
                'C2' => 3.37,
                'C3' => 2.25,
                'D' => 1.80,
            ],
            '7_10' => [
                'B1_1' => 5.59,
                'B1_2' => 5.08,
                'B1_3' => 4.62,
                'B1_4' => 4.21,
                'B1_5' => 3.83,
                'B2_1' => 4.36,
                'B2_2' => 3.96,
                'B2_3' => 3.79,
                'B2_4' => 3.38,
                'B3_1' => 4.02,
                'B3_2' => 3.62,
                'B3_3' => 3.45,
                'B3_4' => 3.04,
                'B4_1' => 3.64,
                'B4_2' => 3.16,
                'B4_3' => 2.99,
                'B4_4' => 2.58,
                'MED_B2_1' => 4.87,
                'MED_B2_2' => 4.28,
                'MED_B2_3' => 4.03,
                'MED_B2_4' => 3.38,
                'MED_B3_1' => 4.53,
                'MED_B3_2' => 3.94,
                'MED_B3_3' => 3.69,
                'MED_B3_4' => 3.04,
                'MED_B4_1' => 3.52,
                'MED_B4_2' => 3.16,
                'MED_B4_3' => 2.93,
                'MED_B4_4' => 2.48,
                'OTHER_B2_1' => 4.02,
                'OTHER_B2_2' => 3.71,
                'OTHER_B2_3' => 3.63,
                'OTHER_B2_4' => 3.38,
                'OTHER_B3_1' => 3.49,
                'OTHER_B3_2' => 3.16,
                'OTHER_B3_3' => 3.08,
                'OTHER_B3_4' => 2.83,
                'C1' => 3.80,
                'C2' => 3.45,
                'C3' => 2.30,
                'D' => 1.84,
            ],
            '10_13' => [
                'B1_1' => 5.70,
                'B1_2' => 5.18,
                'B1_3' => 4.71,
                'B1_4' => 4.29,
                'B1_5' => 3.90,
                'B2_1' => 4.42,
                'B2_2' => 4.02,
                'B2_3' => 3.85,
                'B2_4' => 3.44,
                'B3_1' => 4.08,
                'B3_2' => 3.68,
                'B3_3' => 3.51,
                'B3_4' => 3.10,
                'B4_1' => 3.69,
                'B4_2' => 3.21,
                'B4_3' => 3.04,
                'B4_4' => 2.63,
                'MED_B2_1' => 4.93,
                'MED_B2_2' => 4.34,
                'MED_B2_3' => 4.09,
                'MED_B2_4' => 3.44,
                'MED_B3_1' => 4.59,
                'MED_B3_2' => 4.00,
                'MED_B3_3' => 3.75,
                'MED_B3_4' => 3.10,
                'MED_B4_1' => 3.57,
                'MED_B4_2' => 3.21,
                'MED_B4_3' => 2.98,
                'MED_B4_4' => 2.53,
                'OTHER_B2_1' => 4.08,
                'OTHER_B2_2' => 3.77,
                'OTHER_B2_3' => 3.69,
                'OTHER_B2_4' => 3.44,
                'OTHER_B3_1' => 3.54,
                'OTHER_B3_2' => 3.21,
                'OTHER_B3_3' => 3.13,
                'OTHER_B3_4' => 2.88,
                'C1' => 3.89,
                'C2' => 3.53,
                'C3' => 2.35,
                'D' => 1.88,
            ],
            '13_16' => [
                'B1_1' => 5.81,
                'B1_2' => 5.28,
                'B1_3' => 4.80,
                'B1_4' => 4.37,
                'B1_5' => 3.97,
                'B2_1' => 4.49,
                'B2_2' => 4.09,
                'B2_3' => 3.92,
                'B2_4' => 3.51,
                'B3_1' => 4.14,
                'B3_2' => 3.74,
                'B3_3' => 3.57,
                'B3_4' => 3.16,
                'B4_1' => 3.74,
                'B4_2' => 3.26,
                'B4_3' => 3.09,
                'B4_4' => 2.68,
                'MED_B2_1' => 5.00,
                'MED_B2_2' => 4.41,
                'MED_B2_3' => 4.16,
                'MED_B2_4' => 3.51,
                'MED_B3_1' => 4.65,
                'MED_B3_2' => 4.06,
                'MED_B3_3' => 3.81,
                'MED_B3_4' => 3.16,
                'MED_B4_1' => 3.62,
                'MED_B4_2' => 3.26,
                'MED_B4_3' => 3.03,
                'MED_B4_4' => 2.58,
                'OTHER_B2_1' => 4.15,
                'OTHER_B2_2' => 3.84,
                'OTHER_B2_3' => 3.76,
                'OTHER_B2_4' => 3.51,
                'OTHER_B3_1' => 3.59,
                'OTHER_B3_2' => 3.26,
                'OTHER_B3_3' => 3.18,
                'OTHER_B3_4' => 2.93,
                'C1' => 3.98,
                'C2' => 3.61,
                'C3' => 2.40,
                'D' => 1.92,
            ],
            'exp2_16_20' => [
                'B1_1' => 5.92,
                'B1_2' => 5.38,
                'B1_3' => 4.89,
                'B1_4' => 4.45,
                'B1_5' => 4.05,
                'B2_1' => 4.56,
                'B2_2' => 4.16,
                'B2_3' => 3.99,
                'B2_4' => 3.58,
                'B3_1' => 4.20,
                'B3_2' => 3.80,
                'B3_3' => 3.63,
                'B3_4' => 3.22,
                'B4_1' => 3.79,
                'B4_2' => 3.31,
                'B4_3' => 3.14,
                'B4_4' => 2.73,
                'MED_B2_1' => 5.07,
                'MED_B2_2' => 4.48,
                'MED_B2_3' => 4.23,
                'MED_B2_4' => 3.58,
                'MED_B3_1' => 4.71,
                'MED_B3_2' => 4.12,
                'MED_B3_3' => 3.87,
                'MED_B3_4' => 3.22,
                'MED_B4_1' => 3.67,
                'MED_B4_2' => 3.31,
                'MED_B4_3' => 3.08,
                'MED_B4_4' => 2.63,
                'OTHER_B2_1' => 4.22,
                'OTHER_B2_2' => 3.91,
                'OTHER_B2_3' => 3.83,
                'OTHER_B2_4' => 3.58,
                'OTHER_B3_1' => 3.65,
                'OTHER_B3_2' => 3.32,
                'OTHER_B3_3' => 3.24,
                'OTHER_B3_4' => 2.99,
                'C1' => 4.07,
                'C2' => 3.69,
                'C3' => 2.46,
                'D' => 1.96,
            ],
            'exp2_20_25' => [
                'B1_1' => 6.03,
                'B1_2' => 5.48,
                'B1_3' => 4.98,
                'B1_4' => 4.53,
                'B1_5' => 4.13,
                'B2_1' => 4.63,
                'B2_2' => 4.23,
                'B2_3' => 4.06,
                'B2_4' => 3.65,
                'B3_1' => 4.26,
                'B3_2' => 3.86,
                'B3_3' => 3.69,
                'B3_4' => 3.28,
                'B4_1' => 3.84,
                'B4_2' => 3.36,
                'B4_3' => 3.19,
                'B4_4' => 2.78,
                'MED_B2_1' => 5.14,
                'MED_B2_2' => 4.55,
                'MED_B2_3' => 4.30,
                'MED_B2_4' => 3.65,
                'MED_B3_1' => 4.77,
                'MED_B3_2' => 4.18,
                'MED_B3_3' => 3.93,
                'MED_B3_4' => 3.28,
                'MED_B4_1' => 3.72,
                'MED_B4_2' => 3.36,
                'MED_B4_3' => 3.13,
                'MED_B4_4' => 2.68,
                'OTHER_B2_1' => 4.29,
                'OTHER_B2_2' => 3.98,
                'OTHER_B2_3' => 3.90,
                'OTHER_B2_4' => 3.65,
                'OTHER_B3_1' => 3.71,
                'OTHER_B3_2' => 3.38,
                'OTHER_B3_3' => 3.30,
                'OTHER_B3_4' => 3.05,
                'C1' => 4.16,
                'C2' => 3.77,
                'C3' => 2.52,
                'D' => 2.01,
            ],
            'exp2_more_25' => [
                'B1_1' => 6.14,
                'B1_2' => 5.58,
                'B1_3' => 5.07,
                'B1_4' => 4.62,
                'B1_5' => 4.21,
                'B2_1' => 4.70,
                'B2_2' => 4.30,
                'B2_3' => 4.13,
                'B2_4' => 3.72,
                'B3_1' => 4.32,
                'B3_2' => 3.92,
                'B3_3' => 3.75,
                'B3_4' => 3.34,
                'B4_1' => 3.89,
                'B4_2' => 3.41,
                'B4_3' => 3.24,
                'B4_4' => 2.83,
                'MED_B2_1' => 5.21,
                'MED_B2_2' => 4.62,
                'MED_B2_3' => 4.37,
                'MED_B2_4' => 3.72,
                'MED_B3_1' => 4.83,
                'MED_B3_2' => 4.24,
                'MED_B3_3' => 3.99,
                'MED_B3_4' => 3.34,
                'MED_B4_1' => 3.77,
                'MED_B4_2' => 3.41,
                'MED_B4_3' => 3.18,
                'MED_B4_4' => 2.73,
                'OTHER_B2_1' => 4.36,
                'OTHER_B2_2' => 4.05,
                'OTHER_B2_3' => 3.97,
                'OTHER_B2_4' => 3.72,
                'OTHER_B3_1' => 3.77,
                'OTHER_B3_2' => 3.44,
                'OTHER_B3_3' => 3.36,
                'OTHER_B3_4' => 3.11,
                'C1' => 4.26,
                'C2' => 3.86,
                'C3' => 2.58,
                'D' => 2.06,
            ],
        );

        if($this->request->isAjaxRequest()){
            $GLOBALS['APPLICATION']->RestartBuffer();
            header('Content-type: application/json');
            $data = array();
            $error = null;
            $success = false;
            $salary = 0;
            $result = 0;

            $post_org = $this->request->getPost('org');
            $position = $this->request->getPost('position');
            $ed_level = $this->request->getPost('ed_level');
            $doc_degree = $this->request->getPost('doc_degree');
            $work_exp = $this->request->getPost('work_exp');
            $workload_hours = $this->request->getPost('workload_hours');
            $qualif_level = $this->request->getPost('qualif_level');
            $qualif_teach_master = $this->request->getPost('qualif_teach_master');
            $class_qualif = $this->request->getPost('class_qualif');
            $honor_title = $this->request->getPost('honor_title');
            $senior_status = $this->request->getPost('senior_status');
            $special_work_condition = $this->request->getPost('special_work_condition');
            $countryside_work = $this->request->getPost('countryside_work');
            $night_work_hours = $this->request->getPost('night_work_hours');
            $holiday_work_hours = $this->request->getPost('holiday_work_hours');
            $overtime_work_hours = $this->request->getPost('overtime_work_hours');
            $ecology_zone = $this->request->getPost('ecology_zone');
            $radiation_zone = $this->request->getPost('radiation_zone');
            $correction_class = $this->request->getPost('correction_class');
            $inclusive_children = $this->request->getPost('inclusive_children');
            $class_leader = $this->request->getPost('class_leader');
            $checking_hours = $this->request->getPost('checking_hours');
            $subject = $this->request->getPost('subject');
            $english_subject = $this->request->getPost('english_subject');
            $english_hours = $this->request->getPost('english_hours');
            $updated_content = $this->request->getPost('updated_content');
            $head_boarding_school = $this->request->getPost('head_boarding_school');
            $head_classrooms = $this->request->getPost('head_classrooms');
            $school_manager = $this->request->getPost('school_manager');
            $teach_work_manager = $this->request->getPost('teach_work_manager');
            $library_fond = $this->request->getPost('library_fond');
            $teach_on_lang = $this->request->getPost('teach_on_lang');
            $deviant_children = $this->request->getPost('deviant_children');
            $work_with_orphans = $this->request->getPost('work_with_orphans');
            $profile_subject_hours = $this->request->getPost('profile_subject_hours');
            $in_innovation = $this->request->getPost('in_innovation');
            $sanatorium = $this->request->getPost('sanatorium');
            $production_org = $this->request->getPost('production_org');
            $pos_combination = $this->request->getPost('pos_combination');
            $absent_person_work = $this->request->getPost('absent_person_work');
            $harmful_condition = $this->request->getPost('harmful_condition');
            $young_specialist = $this->request->getPost('young_specialist');
            $mentoring = $this->request->getPost('mentoring');
            $academic_degree = $this->request->getPost('academic_degree');
            $academic_title = $this->request->getPost('academic_title');

            if($this->isNotNull($position) && $this->isNotNull($work_exp)){
                if(isset($coefficient[$work_exp]) && isset($coefficient[$work_exp][$position])){
                    $salary = self::BASIC_SALARY * $coefficient[$work_exp][$position];
                    $result = $salary;
                }
            }

            if($this->isNotNull($workload_hours)){
                $result = ($salary * $workload_hours) / 18;
            }

            if($this->isNotNull($doc_degree)){
                if($doc_degree == 1){
                    $result += self::MIN_SALARY * 1;
                }
                if($doc_degree == 2){
                    $result += self::MIN_SALARY * 2;
                }
            }

            if($this->isNotNull($qualif_level)){
                if($qualif_level == 1){
                    $result += $salary*(100/100);
                }
                if($qualif_level == 2){
                    $result += $salary*(70/100);
                }
                if($qualif_level == 3){
                    $result += $salary*(30/100);
                }
            }

            if($this->isNotNull($honor_title)){
                if($honor_title == 1){
                    $result += self::BASIC_SALARY * (50 / 100);
                }
                if($honor_title == 2){
                    $result += self::BASIC_SALARY * (30 / 100);
                }
            }

            if($this->isNotNull($senior_status)){
                $result += self::BASIC_SALARY * (25/100);
            }

            if($this->isNotNull($special_work_condition)){
                $result += $salary * (10/100);
            }

            if($this->isNotNull($countryside_work)){
                $result += $salary * (25/100);
            }

            if($this->isNotNull($night_work_hours)){
                $result += (($salary / 168) / 2) * $night_work_hours;
            }

            if($this->isNotNull($holiday_work_hours)){
                $result += (($salary / 168) / 2) * $holiday_work_hours;
            }

            if($this->isNotNull($overtime_work_hours)){
                $result += (($salary / 168) / 2) * $overtime_work_hours;
            }

            if($this->isNotNull($ecology_zone)){
                if($ecology_zone == 1){
                    $result += $salary * (50/100);
                }
                if($ecology_zone == 2){
                    $result += $salary * (30/100);
                }
                if($ecology_zone == 3){
                    $result += $salary * (20/100);
                }
            }

            if($this->isNotNull($radiation_zone)){
                if($radiation_zone == 1){
                    $result += self::MRP * 2;
                }
                if($radiation_zone == 2){
                    $result += self::MRP * 1.75;
                }
                if($radiation_zone == 3){
                    $result += self::MRP * 1.5;
                }
                if($radiation_zone == 4){
                    $result += self::MRP * 1.25;
                }
            }

            if($this->isNotNull($correction_class)){
                if($correction_class == 1){
                    $result += self::BASIC_SALARY * (30/100);
                }
            }

            if($this->isNotNull($inclusive_children)){
                if($inclusive_children == 1){
                    $result += self::BASIC_SALARY * (40/100);
                }
                if($inclusive_children == 2){
                    $result += self::BASIC_SALARY * (40/100);
                }
                if($inclusive_children == 3){
                    $result += self::BASIC_SALARY * (50/100);
                }
            }

            if($this->isNotNull($class_leader)){
                if($class_leader == 1){
                    $result += self::BASIC_SALARY * (25/100);
                }
                if($class_leader == 2){
                    $result += self::BASIC_SALARY * (30/100);
                }
                if($class_leader == 3){
                    $result += self::BASIC_SALARY * (25/100);
                }
            }

            if($this->isNotNull($head_boarding_school)){
                $result += self::BASIC_SALARY * (25/100);
            }

            if($this->isNotNull($head_classrooms)){
                if($head_classrooms == 1){
                    $result += self::BASIC_SALARY * (20/100);
                }
                if($head_classrooms == 2){
                    $result += self::BASIC_SALARY * (25/100);
                }
                if($head_classrooms == 3){
                    $result += self::BASIC_SALARY * (30/100);
                }
            }

            if($this->isNotNull($school_manager)){
                $result += self::BASIC_SALARY * (20/100);
            }

            if($this->isNotNull($teach_work_manager)){
                $result += self::BASIC_SALARY * (30/100);
            }

            if($this->isNotNull($library_fond)){
                $result += self::BASIC_SALARY * (20/100);
            }

            if($this->isNotNull($deviant_children)){
                $result += self::BASIC_SALARY * (30/100);
            }

            if($this->isNotNull($work_with_orphans)){
                $result += self::BASIC_SALARY * (30/100);
            }

            if($this->isNotNull($in_innovation)){
                $result += self::BASIC_SALARY * (20/100);
            }

            if($this->isNotNull($sanatorium)){
                $result += self::BASIC_SALARY * (60/100);
            }

            if($this->isNotNull($production_org)){
                $result += self::BASIC_SALARY * (100/100);
            }

            if($this->isNotNull($pos_combination)){
                $result += $salary * (50/100);
            }

            $data['success'] = $success;
            $data['error'] = $error;
            $data['result'] = round($result, 2);
            $data['work_exp'] = $coefficient[$work_exp][$position];

            echo json_encode($data);
            exit();
        }

        $this->includeComponentTemplate();
        return $this->arResult;
    }

    protected function isNotNull($var)
    {
        return !is_null($var) && !empty($var);
    }

}
?>